import pickle
try:
	data = pickle.load(open('database/data.dat', 'rb'))
except:
	data = {
		1:{
			"материал":"М01",
			"тип":"d=57",
			"кол-во":"7м",
			"есть/закуп":"есть",
			"автор заказа":{
				"ФИО":"Иванов",
				"Т/Н":"1"
			},
			"дата заказа":"2017.12.11",
		},
		11:{
			"материал":"М01",
			"тип":"d=22",
			"кол-во":"5м",
			"есть/закуп":"нет",
			"автор заказа":{
				"ФИО":"Иванов",
				"Т/Н":"1"
			},
			"дата заказа":"2017.11.1",
		},
		111:{
			"материал":"М01",
			"тип":"d=22",
			"кол-во":"7м",
			"есть/закуп":"нет",
			"автор заказа":{
				"ФИО":"Пертов",
				"Т/Н":"1"
			},
			"дата заказа":"2017.11.11",
		},
	}
	pickle.dump(data, open('database/data.dat', 'wb'))
